### Extract the first file from GitHub

In [392]:
import pandas as pd
csv_url = "https://raw.githubusercontent.com/datasets/covid-19/master/data/time-series-19-covid-combined.csv"
data = pd.read_csv(csv_url)
data.head()

         Date Country/Region Province/State  Confirmed  Recovered  Deaths
0  2020-01-22    Afghanistan            NaN          0        0.0       0
1  2020-01-23    Afghanistan            NaN          0        0.0       0
2  2020-01-24    Afghanistan            NaN          0        0.0       0
3  2020-01-25    Afghanistan            NaN          0        0.0       0
4  2020-01-26    Afghanistan            NaN          0        0.0       0

In [393]:
data.info

<bound method DataFrame.info of               Date Country/Region Province/State  Confirmed  Recovered  Deaths
0       2020-01-22    Afghanistan            NaN          0        0.0       0
1       2020-01-23    Afghanistan            NaN          0        0.0       0
2       2020-01-24    Afghanistan            NaN          0        0.0       0
3       2020-01-25    Afghanistan            NaN          0        0.0       0
4       2020-01-26    Afghanistan            NaN          0        0.0       0
...            ...            ...            ...        ...        ...     ...
231739  2022-04-12       Zimbabwe            NaN     247094        0.0    5460
231740  2022-04-13       Zimbabwe            NaN     247160        0.0    5460
231741  2022-04-14       Zimbabwe            NaN     247208        0.0    5462
231742  2022-04-15       Zimbabwe            NaN     247237        0.0    5462
231743  2022-04-16       Zimbabwe            NaN     247237        0.0    5462

[231744 rows x 6 columns]>

### Extract the second file from Archive

In [395]:
# URL of the dataset
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/car/car.data'
df_before = pd.read_csv(url)
df_before.head()

   vhigh vhigh.1  2 2.1  small   low  unacc
0  vhigh   vhigh  2   2  small   med  unacc
1  vhigh   vhigh  2   2  small  high  unacc
2  vhigh   vhigh  2   2    med   low  unacc
3  vhigh   vhigh  2   2    med   med  unacc
4  vhigh   vhigh  2   2    med  high  unacc

In [396]:
# 1. Transformation of making header to dataset
column_names = ['buying', 'maint', 'doors', 'persons', 'lug_boot', 'safety', 'class']
df_after = pd.read_csv(url, header=None, names=column_names)
df_after.head()

  buying  maint doors persons lug_boot safety  class
0  vhigh  vhigh     2       2    small    low  unacc
1  vhigh  vhigh     2       2    small    med  unacc
2  vhigh  vhigh     2       2    small   high  unacc
3  vhigh  vhigh     2       2      med    low  unacc
4  vhigh  vhigh     2       2      med    med  unacc

In [397]:
#checking missing value for second dataset after transformation
df_after.isnull().sum()

buying      0
maint       0
doors       0
persons     0
lug_boot    0
safety      0
class       0
dtype: int64

In [398]:
#checking missing value for first dataset
data.isnull().sum()

Date                   0
Country/Region         0
Province/State    159120
Confirmed              0
Recovered          13056
Deaths                 0
dtype: int64

In [399]:
total_rows = data[data["Province/State"].notnull()]
total_rows

,Date,Country/Region,Province/State,Confirmed,Recovered,Deaths
7344,2020-01-22,Australia,Australian Capital Territory,0,0.0,0
7345,2020-01-23,Australia,Australian Capital Territory,0,0.0,0
7346,2020-01-24,Australia,Australian Capital Territory,0,0.0,0
7347,2020-01-25,Australia,Australian Capital Territory,0,0.0,0
7348,2020-01-26,Australia,Australian Capital Territory,0,0.0,0
...,...,...,...,...,...,...
222763,2022-04-12,United Kingdom,Turks and Caicos Islands,5923,0.0,36
222764,2022-04-13,United Kingdom,Turks and Caicos Islands,5936,0.0,36
222765,2022-04-14,United Kingdom,Turks and Caicos Islands,5936,0.0,36
222766,2022-04-15,United Kingdom,Turks and Caicos Islands,5936,0.0,36
222767,2022-04-16,United Kingdom,Turks and Caicos Islands,5936,0.0,36

In [400]:
data["Province/State"].fillna("Unkown", inplace=True)

C:\Users\pc\AppData\Local\Temp\ipykernel_5132\146709188.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Province/State"].fillna("Unkown", inplace=True)

In [401]:
data.head()

         Date Country/Region Province/State  Confirmed  Recovered  Deaths
0  2020-01-22    Afghanistan         Unkown          0        0.0       0
1  2020-01-23    Afghanistan         Unkown          0        0.0       0
2  2020-01-24    Afghanistan         Unkown          0        0.0       0
3  2020-01-25    Afghanistan         Unkown          0        0.0       0
4  2020-01-26    Afghanistan         Unkown          0        0.0       0

In [402]:
data.isnull().sum()

Date                  0
Country/Region        0
Province/State        0
Confirmed             0
Recovered         13056
Deaths                0
dtype: int64

In [403]:
# fill missing value with mean in Recovered column
data["Recovered"].fillna(data["Recovered"].mean(), inplace=True)

C:\Users\pc\AppData\Local\Temp\ipykernel_5132\1338355703.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Recovered"].fillna(data["Recovered"].mean(), inplace=True)

In [404]:
# checking if the missing value have been replaced by mean
total_rows = data[data["Recovered"].isnull()]
total_rows

Empty DataFrame
Columns: [Date, Country/Region, Province/State, Confirmed, Recovered, Deaths]
Index: []

In [405]:
# concatenate the datasets
concate = pd.concat([df_after,data], axis = 0, ignore_index=True)

In [406]:
#display concatinated file

concate

,buying,maint,doors,persons,lug_boot,safety,class,Date,Country/Region,Province/State,Confirmed,Recovered,Deaths
0,vhigh,vhigh,2,2,small,low,unacc,NaN,NaN,NaN,NaN,NaN,NaN
1,vhigh,vhigh,2,2,small,med,unacc,NaN,NaN,NaN,NaN,NaN,NaN
2,vhigh,vhigh,2,2,small,high,unacc,NaN,NaN,NaN,NaN,NaN,NaN
3,vhigh,vhigh,2,2,med,low,unacc,NaN,NaN,NaN,NaN,NaN,NaN
4,vhigh,vhigh,2,2,med,med,unacc,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
233467,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2022-04-12,Zimbabwe,Unkown,247094.0,0.0,5460.0
233468,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2022-04-13,Zimbabwe,Unkown,247160.0,0.0,5460.0
233469,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2022-04-14,Zimbabwe,Unkown,247208.0,0.0,5462.0
233470,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2022-04-15,Zimbabwe,Unkown,247237.0,0.0,5462.0
233471,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2022-04-16,Zimbabwe,Unkown,247237.0,0.0,5462.0

In [407]:
concate.isnull().sum()

buying            231744
maint             231744
doors             231744
persons           231744
lug_boot          231744
safety            231744
class             231744
Date                1728
Country/Region      1728
Province/State      1728
Confirmed           1728
Recovered           1728
Deaths              1728
dtype: int64

In [408]:
# Check for duplicate rows
duplicates = df_after.duplicated()

## Load Data to Data Warehouse

In [410]:
import sqlite3

In [411]:
conn = sqlite3.connect('dataWareHouse.db')

In [412]:
data.to_sql('data',conn, if_exists='replace', index=False)

231744

In [413]:
df_after.to_sql('df_after',conn, if_exists='replace', index=False)

1728

In [414]:
df_before.to_sql('df_before',conn, if_exists='replace', index=False)

1727

In [415]:
print(pd.read_sql('SELECT * FROM data LIMIT 10',conn))

         Date Country/Region Province/State  Confirmed  Recovered  Deaths
0  2020-01-22    Afghanistan         Unkown          0        0.0       0
1  2020-01-23    Afghanistan         Unkown          0        0.0       0
2  2020-01-24    Afghanistan         Unkown          0        0.0       0
3  2020-01-25    Afghanistan         Unkown          0        0.0       0
4  2020-01-26    Afghanistan         Unkown          0        0.0       0
5  2020-01-27    Afghanistan         Unkown          0        0.0       0
6  2020-01-28    Afghanistan         Unkown          0        0.0       0
7  2020-01-29    Afghanistan         Unkown          0        0.0       0
8  2020-01-30    Afghanistan         Unkown          0        0.0       0
9  2020-01-31    Afghanistan         Unkown          0        0.0       0

In [416]:
print(pd.read_sql('SELECT * FROM df_after LIMIT 10',conn))

  buying  maint doors persons lug_boot safety  class
0  vhigh  vhigh     2       2    small    low  unacc
1  vhigh  vhigh     2       2    small    med  unacc
2  vhigh  vhigh     2       2    small   high  unacc
3  vhigh  vhigh     2       2      med    low  unacc
4  vhigh  vhigh     2       2      med    med  unacc
5  vhigh  vhigh     2       2      med   high  unacc
6  vhigh  vhigh     2       2      big    low  unacc
7  vhigh  vhigh     2       2      big    med  unacc
8  vhigh  vhigh     2       2      big   high  unacc
9  vhigh  vhigh     2       4    small    low  unacc

In [417]:
print(pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';",conn))

        name
0       data
1   df_after
2  df_before